package android.example.chat007;

public class UTILS {
    public static final String NAME1= "Central Intelligence Agency";
    public static final String DESCRIPTION1 = "Центральное разведывательное управление США, ЦРУ (англ. Central Intelligence Agency, CIA) — агентство Федерального правительства США, основной функцией которого является сбор и анализ информации о деятельности иностранных организаций и граждан. Основной орган внешней разведки и контрразведки США. Деятельность ЦРУ бывает сопряжена с возможностью её официального непризнания. Штаб-квартира ЦРУ, также известная как Разведывательный центр имени Джорджа Буша-старшего, находится в Лэнгли, округ Фэрфакс, штат Виргиния, в 13 км от Вашингтона.\n" +
            "\n" +
            "В отличие от Федерального бюро расследований, который представляет собой службу внутренней безопасности, Центральное Разведывательное Управление не имеет функций правоохранительных органов и в основном сосредоточено на внешней разведке, но с некоторыми элементами внутренней разведки и контрразведки. Хотя это не единственное правительственное агентство США, специализирующееся на разведке за рубежом, существует также Агентство Национальной безопасности, осуществляющее также и радиоэлектронную разведку. Кроме того, ЦРУ является единственным органом, уполномоченным законно осуществлять и контролировать тайные операции по указанию президента. ЦРУ оказывает внешнеполитическое влияние через свои тактические подразделения, такие, как Отдел специальных мероприятий.\n" +
            "\n" +
            "ЦРУ входит в Разведывательное сообщество США, которым руководит Директор Национальной разведки.";
    public static final String NAME2 = "MI 6";
    public static final String DESCRIPTION2 = "«Секре́тная разве́дывательная слу́жба МИД Великобритании», (СИС/MИ-6) ((англ. Secret Intelligence Service, SIS/Military Intelligence, MI6) — служба внешнеполитической разведки Великобритании. Cлужба разведки МИД является частью аппарата правительства" +
            " и подчинена одновременно МИД и Объединённому комитету правительства по разведке. Начальник СИС является членом коллегии МИД (госсекретарь в ранге зам. министра) и единственным известным госслужащим в системе разведки. С 1994 г. центральный аппарат СИС находится в правительственном р-не Вестминстер, в здании №85 по наб. Принца Альберта, г. Лондон. Основную правовую базу ведущейся разведдеятельности Великобритании составляет «Закон о разведслужбах» от 1994 г. (Intelligence Services Act 1994), до опубликования которого существование внешней разведки официально отрицалось на правительственном уровне.";

    public static final String NAME3 = "Silver X-files";
    public static final String DESCRIPTION3 = "Top Secret";
}
